Studio/projects/sample_refManual_http/soap-templates/globalCompany_HR_WSSOAPBinding/CgetDepartment.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://www.convertigo.com/convertigo/projects/globalCompany_HR_WS">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:getDepartment>
         <!--type: string-->
         <glob:depId>$(GLOB_DEPID)</glob:depId>
      </glob:getDepartment>
   </soapenv:Body>
</soapenv:Envelope>